ci4/app/Controllers/AjaxController.php

SELECT *
FROM `artikel`
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->findAll();