ci4/app/Controllers/Page.php

SELECT *
FROM `artikel`
WHERE `slug` = 'artikel pertama'
 LIMIT 1
---
    public function artikel($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('slug', $slug)->first();