app/Cells/ArtikelTerkini.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function render(array $params = []): string
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('tanggal', 'DESC')
            ->limit(5)
            ->findAll();