app/Controllers/Home.php

SELECT *
FROM `artikel`
---
    public function index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();