app/Controllers/Page.php

    public function daftarArtikel()
    {
        $model = new ArtikelModel();
        $data = [
            'title'   => 'Daftar Artikel',
            'artikel' => $model->findAll()
---
SELECT *
FROM `artikel`

    public function artikel($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'Youth-Experience'
 LIMIT 1